{
    "books": [
      {
        "id": "book1",
        "title": "Peek",
        "author": "Osha",
        "cover": "cover1.jpg",
        "chapters": [
          {
            "title": "Chapter 1: Our House",
            "content": "My family’s house is unusual. It has a semi-unfinished style—industrial, if I’m being modest. I don’t know if my father intended it that way or if he just ran out of money. On the first floor, we have the living room, a combined dining and kitchen area, and the bedrooms. Our living room is far more spacious than in a typical house, but it feels oddly empty. There’s only one sofa—an ugly one at that—and a large television on the wall. The distance between the sofa and the TV is so long that my dad bought a 200-inch TV instead of a regular-sized one. The dining kitchen has a real restaurant-style setup, with all the appliances you could want. But my mom only cooks us regular meals. Fortunately, my sister has developed a passion for cooking and often prepares fancy dishes. She loves making Italian cuisine. The house has four bedrooms—one main bedroom for our parents and the rest for the kids, me and my siblings. Our bedrooms are actually pretty normal compared to the rest of the house, even a bit fancy since each one has its own private bathroom. On the second floor, there are two rooms: a hobby room and a secret room. The hobby room is a space my father built for us to work on our hobbies. It’s filled with computers, toys, DIY tools, and even my mother’s sewing machine. This is the room where I spent most of my time after school, and it’s where I developed my love for reading. My sister enjoys reading here too. Every week, my father would buy us books. He knew I was interested in astrophysics, so he often got me books on that subject. But my little brother is different—he wasn’t as interested in physical books. He preferred reading and writing on the computer. Even though internet access was rare back then, my father made sure we had it. My brother would often lose track of time in front of the screen, and my mother would call him to dinner using the loud intercom system that my father installed. Yes, we have an intercom in every room. Very strange house indeed. The last room was the secret room. My father forbade us from entering. I don’t know why; he just told us not to go in. But the room was never locked. I found that out because I was curious. One day, I twisted the door knob, and it wasn’t locked. But I quickly closed it because I was too scared. I did that three times out of curiosity, but I’ve never actually opened the door. This is the only room with a heavy steel door. All the other rooms just have wooden ones."
          },
          {
            "title": "Chapter 2: The Journey",
            "content": "Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat."
          }
        ]
      },
      {
        "id": "book2",
        "title": "Another Light Novel",
        "author": "Another Author",
        "cover": "cover2.jpg",
        "chapters": [
          {
            "title": "Chapter 1: A New Start",
            "content": "Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur."
          },
          {
            "title": "Chapter 2: Unexpected Turns",
            "content": "Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
          }
        ]
      }
    ]
  }